(function(){
  window.DATA = {
    "last_update": "2013-09-05T08:01:49.571Z",
    "events": [
      {
        "day": 30,
        "month": "авг",
        "title": "Визит <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне волонтеров из <a href=\"https://www.facebook.com/blueskytalentcompany\">BlueSky</a>",
        "body": "Визит <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне волонтеров из <a href=\"https://www.facebook.com/blueskytalentcompany\">BlueSky</a> и братом Сергием. Мастер-класс по иллюзии, обучение, игры.",
        "event_time": "10:00",
        "event_place": "ПНИ в Дражне",
        "organizer": "брат Сергий",
        "phone": "8 (029) 373-72-50"
      },
      {
        "day": 30,
        "month": "авг",
        "title": "Выезд в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> г. Молодечно",
        "body": "Выезд в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> г. Молодечно, с Дмитрием Каминским (поэт и исполнитель, финалист проекта \"Фабрика звезд\"). Перед выступлением будет проводиться встреча с волонтерами из <a href=\"https://www.facebook.com/blueskytalentcompany\">BlueSky</a> — мастер-класс по иллюзии, обучение, игры",
        "meeting_time": "13:00",
        "meeting_place": "ст. м. Каменная Горка",
        "organizer": "брат Сергий",
        "phone": "8 (029) 373-72-50"
      },
      {
        "day": 31,
        "month": "авг",
        "title": "Поездка в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> д. Тарасики",
        "meeting_time": "12:00",
        "meeting_place": "<i>уточнять по телефону у брата Сергия</i>",
        "organizer": "брат Сергий",
        "phone": "8 (029) 373-72-50"
      },
      {
        "day": 4,
        "month": "сен",
        "title": "Поездка в Столбцовский <abbr title=\"Психоневрологический интернат\">ПНИ</abbr>",
        "meeting_time": "12:00",
        "organizer": "брат Сергий",
        "phone": "8 (029) 373-72-50"
      },
      {
        "day": 5,
        "month": "сен",
        "title": "Фестиваль «Чулае сэрца»",
        "body": "Принимаем участие в фестивале «Чулае сэрца» для детей с особенностями психофизического развития, детей инвалидов, онкобольных.",
        "event_place": "Агроусадьба «Велюна», д. Бровки",
        "meeting_time": "10:30",
        "meeting_place": "Свято-Елисаветинский монастырь",
        "organizer": "брат Сергий",
        "phone": "8 (029) 373-72-50"
      },
      {
        "day": 6,
        "month": "сен",
        "title": "Выезд с <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Семашко в Логойск",
        "body": "Везем проживающих <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Семашко в Логойск на святой источник",
        "organizer": "брат Сергий, отец Родион",
        "phone": "8 (029) 373-72-50"
      },
      {
        "day": 6,
        "month": "сен",
        "title": "Молебен в храме Преображения",
        "body": "В храме Преображения Господня в Заславле состоится молебен для паломников из Заславля. Просьба быть всем, без опозданий.",
        "event_time": "17:00",
        "event_place": "храм Преображения Господня в г. Заславле"
      },
      {
        "day": 6,
        "month": "ceн",
        "title": "Поездка в Лавришево",
        "body": "<p><b>С 6 по 8 сентября</b> паломническая поездка с послушанием в Свято-Елисеевский мужской монастырь в Лавришево</p><ul><li>Постельные принадлежности выдадут</li><li>Кормить будут</li><li>Взять теплые вещи — осень на дворе</li><li>Старшим в группах взять по чайнику</li></ul><p>Просьба, также взять с собой жертвочку для монастыря, хотябы 50000 бел. рублей</p>",
        "meeting_time": "<br>18:00 — <b>Минск</b><br>17:00 — <b>Заславль</b>, ",
        "meeting_place": "<br>ст.м Петровщина <i>(стоянка Макдональдс)</i> — <b>Минск</b><br>храм Преображения Господня — <b>Заславль</b>",
        "organizer": "брат Сергий",
        "phone": "8 (029) 373-72-50",
        "cost": "<b>70 000</b> бел. рублей"
      }
    ]
  };
})()