(function(){
  angular.module("app.data", []).constant("DATA", {
  "last_update": "2013-10-07T19:00:00.000+0300",

  "ads": [
    {
      "body": "<p>Братья и сестры сегодня <b>в 13.00 встречаемся на «Покровском Кирмаше»</b> возле нашей скарбонки, 2 этаж, в наших майках.</b>",
      "show_to": "2013-10-06T15:00:00.000+0300",
      "priority": 30,
      "style": "orange"
    },
    {
      "body": "<p>Сайт <strong>в процессе разработки</strong>, поэтому часть информации будет <strong>недоступна</strong>, но она должна скоро появиться в обновленном формате, <strong>помолитесь</strong> за нас чтобы у нас все получилось...</p><p><a href=\"http://old.bratstvost.by\" class=\"btn btn-info\">Старый сайт →</a></p>",
      "show_to": "2013-12-31T23:59:59.999+0300",
      "priority": 0,
      "style": "well-oldsite"
    },
    {
      "body": "<p>Просим ваших молитв братья и сестры <strong>о новопреставленном р.Б.Вячеславе</strong> (был в коме).</p><p><em> — Упокой Господи душу усопшего раба Твоего Вячеслава и прости ему вся согрешения вольная и невольная и даруй ему Царствие Небесное!</em></p><p>Поддержим нашу сестру Елену общей молитвой!<br>Спаси всех Господь!</p>",
      "show_to": "2013-11-12T23:59:59.999+0300",
      "priority": 10,
      "style": "red"
    },
    {
      "body": "<p>С 5 октября по 12 октября в Палаце Мастатства пройдет <strong>выставка-ярмарка «Покровский кирмаш»</strong>.</p><p>10 и 11-ого октября в 17.30 и 12 октября в 10.30 состоятся <strong>беседы архимандрита Амвросия (Юрасова)</strong> из г. Иваново.</p><p>Рекомендуем!</p>",
      "show_to": "2013-10-12T12:00:00.000+0300",
      "priority": 5,
      "style": "green"
    },
    {
      "body": "<p>У нашей сестры Елены, отец р.Б. Вячеслав после инсульта впал в кому. Братчики просим ваших молитв за болящего.</p>",
      "show_to": "2013-10-01T00:00:00.000+0300",
      "priority": 10,
      "style": "red"
    },
    {
      "body": "<a style=\"float:left; padding: 16px 20px 10px 0\" href=\"https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-ash3/p480x480/529167_507211549364362_1594327722_n.jpg\"><img width=\"120\" src=\"https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-ash3/p480x480/529167_507211549364362_1594327722_n.jpg\" alt=\"Рождество Пресвятой Богородицы\"></a><h4>21 сентября – Рождество Пресвятой Богородицы.</h4><p>Митрополит Антоний Сурожский:<br>Сегодня — праздник Божией Матери, Ее Рождество. Это время, когда родилась Та, Которая сумела за нас за всех, за весь человеческий род так поверить, так уверовать, так отдаться Богу, что Бог смог стать Человеком через Нее и дать нам эти бесчисленные, непостижимые для нас дары. Слава Ее смирению, слава Ее вере, слава Ее любви, слава Богу, воплотившемуся в Деве Богородице, слава достойному сосуду воплощения Сына Божия, Христа Бога нашего!</p>",
      "show_to": "2013-09-22T00:00:00.000+0300",
      "priority": 0
    }
  ],
  "news": [
    {
      "date": "2013-09-19",
      "text": "<p>Братчики с отцом Николаем <i>(духовником Братства святителя Спиридона)</i> по милости Божией приняли в дар от брата Константина для храма Преображения Господня в г.Заславль частичку святых мощей преподобного Сергия Радонежского. Святыня будет находиться в храме, а также по благословению отца настоятеля будет вывозиться для поклонения в инернаты. <b>Слава Богу за чудный дар!</b></p>"
    },
    {
      "date": "2013-09-09T18:33:49.771Z",
      "text": "<p>Возможность помогать больным людям — это дар Божий — Сергей Довгаль о служении в психоневрологических интернатах.</p><p><a class=\"btn btn-info btn-sm more\" href=\"http://www.youtube.com/watch?v=p5k_0m0wEy8&feature=player_embedded&list=UU-Vlk4PCO82-yKzt6zxkN0g\">Смотреть видео →</a></p>"
    },
    {
      "date": "2013-09-29T17:20:00.000+0300",
      "text": "<p>Австралийский гитарист Tom Ward в психоневрологическом интернате</p><p><a class=\"btn btn-info btn-sm more\" href=\"http://www.youtube.com/watch?list=UU-Vlk4PCO82-yKzt6zxkN0g&v=CESgW38kg-8&feature=player_detailpage\">Смотреть видео →</a></p>"
    }
  ],
  "events": [
    {
      "date": "2013-08-29T21:00:00.000Z",
      "title": "Визит <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне волонтеров из <a href=\"https://www.facebook.com/blueskytalentcompany\">BlueSky</a>",
      "body": "Визит <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне волонтеров из <a href=\"https://www.facebook.com/blueskytalentcompany\">BlueSky</a> и братом Сергием. Мастер-класс по иллюзии, обучение, игры.",
      "event_time": "10:00",
      "event_place": "ПНИ в Дражне",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-08-29T21:00:00.000Z",
      "title": "Выезд в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> г. Молодечно",
      "body": "Выезд в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> г. Молодечно, с Дмитрием Каминским (поэт и исполнитель, финалист проекта \"Фабрика звезд\"). Перед выступлением будет проводиться встреча с волонтерами из <a href=\"https://www.facebook.com/blueskytalentcompany\">BlueSky</a> — мастер-класс по иллюзии, обучение, игры",
      "meeting_time": "13:00",
      "meeting_place": "ст. м. Каменная Горка",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-08-30T21:00:00.000Z",
      "title": "Поездка в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> д. Тарасики",
      "meeting_time": "12:00",
      "meeting_place": "<i>уточнять по телефону у брата Сергия</i>",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-03T21:00:00.000Z",
      "title": "Поездка в Столбцовский <abbr title=\"Психоневрологический интернат\">ПНИ</abbr>",
      "meeting_time": "12:00",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-04T21:00:00.000Z",
      "title": "Фестиваль «Чулае сэрца»",
      "body": "Принимаем участие в фестивале «Чулае сэрца» для детей с особенностями психофизического развития, детей инвалидов, онкобольных.",
      "event_place": "Агроусадьба «Велюна», д. Бровки",
      "meeting_time": "10:30",
      "meeting_place": "Свято-Елисаветинский монастырь",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-05T21:00:00.000Z",
      "title": "Выезд с <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Семашко в Логойск",
      "body": "Везем проживающих <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Семашко в Логойск на святой источник",
      "organizer": "брат Сергий, отец Родион",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-05T21:00:00.000Z",
      "title": "Молебен в храме Преображения",
      "body": "В храме Преображения Господня в Заславле состоится молебен для паломников из Заславля. Просьба быть всем, без опозданий.",
      "event_time": "17:00",
      "event_place": "храм Преображения Господня в г. Заславле"
    },
    {
      "date": "2013-09-05T21:00:00.000Z",
      "title": "Поездка в Лавришево",
      "body": "<p><b>С 6 по 8 сентября</b> паломническая поездка с послушанием в Свято-Елисеевский мужской монастырь в Лавришево</p><ul><li>Постельные принадлежности выдадут</li><li>Кормить будут</li><li>Взять теплые вещи — осень на дворе</li><li>Старшим в группах взять по чайнику</li></ul><p>Просьба, также взять с собой жертвочку для монастыря, хотябы 50000 бел. рублей</p>",
      "meeting_time": "<br>18:00 — <b>Минск</b><br>17:00 — <b>Заславль</b>, ",
      "meeting_place": "<br>ст.м Петровщина <i>(стоянка Макдональдс)</i> — <b>Минск</b><br>храм Преображения Господня — <b>Заславль</b>",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>",
      "cost": "<b>70 000</b> бел. рублей"
    },
    {
      "date": "2013-09-10T21:00:00.000Z",
      "title": "Выезд <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Молодечно в г.Логойск",
      "body": "<ul><li>Молебен в храме святителя Николая</li><li>Купание в святом источнике</li><li>Трапеза</li></ul>",
      "event_place": "храм св. Николая в г. Логойск",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-10T21:00:00.000Z",
      "title": "Посещение <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне",
      "event_time": "18:00",
      "event_place": "ул. Ваупшасова, д. 33",
      "organizer": "сестра Татьяна",
      "phone": "<a href=\"phone:+375291432177\">8 (029) 143-21-77</a>"
    },
    {
      "date": "2013-09-11T21:00:00.000Z",
      "title": "Концерт Д.Каминского в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Новинках",
      "body": "<p>Cольный концерт Дмитрия Каминского в детском <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Новинках</p>",
      "event_time": "11:00",
      "event_place": "ул. Выготского, д. 16",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-12T21:00:00.000Z",
      "title": "Экскурсия для <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне по г.Минску",
      "body": "Обзорная экскурсия насельников <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне по г.Минску</p>",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-13T21:00:00.000Z",
      "title": "Выезд <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Тарасики в г.Логойск",
      "body": "<ul><li>Молебен в храме святителя Николая</li><li>Купание в святом источнике</li><li>Трапеза</li></ul>",
      "event_place": "храм св. Николая в г. Логойск",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-14T21:00:00.000Z",
      "title": "Выход <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне в храм",
      "body": "Выход с проживающими из ПНИ в Дражне в храм в честь иконы Божией Матери «Донская»",
      "event_time": "9:00",
      "event_place": "ул. Ваупшасова, д. 33",
      "organizer": "брат Алексей",
      "phone": "<a href=\"phone:+375296202075\">8 (029) 620-20-75</a>"
    },
    {
      "date": "2013-09-17",
      "title": "Посещение <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне",
      "event_time": "18:00",
      "event_place": "ул. Ваупшасова, д. 33",
      "organizer": "сестра Татьяна",
      "phone": "<a href=\"phone:+375291432177\">8 (029) 143-21-77</a>"
    },
    {
      "date": "2013-09-18",
      "title": "Выезд <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Куль в г.Логойск",
      "body": "<ul><li>Молебен в храме святителя Николая</li><li>Купание в святом источнике</li><li>Трапеза</li></ul>",
      "event_place": "храм св. Николая в г. Логойск",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-19",
      "title": "Концерт ПНИ в Дражне для братчиков",
      "body": "Праздничный концерт проживающих ПНИ в Дражне для братчиков",
      "event_time": "10:00",
      "event_place": "ул. Ваупшасова, д. 33",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-20",
      "title": "Выезд Борисовского <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> г.Логойск",
      "body": "<ul><li>Молебен в храме святителя Николая</li><li>Купание в святом источнике</li><li>Трапеза</li></ul>",
      "event_place": "храм св. Николая в г. Логойск",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-21",
      "title": "Престольный Праздник в храме Рождества Пресвятой Богородицы",
      "body": "В нашем Благочинии, в храме Рождества Пресвятой Богородицы, в Старом селе, состоится праздничная Литургия",
      "event_time": "10.00 <i>(начало Литургии)</i>",
      "event_place": "п. Старое село",
      "meeting_place": "ст. м. Каменная горка",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-24",
      "title": "Выезд в дет. интернат в Молодено",
      "body": "Выезд с Дмитрием Каминским в детский, интернат с проблемами зрения в г. Молодечно",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-25",
      "title": "Выступление Тома Уорда в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне",
      "body": "<p>В <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне выступление Тома Уорда <i>(гитарист из Австралии)</i></p>",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-26",
      "title": "Выступление Тома Уорда в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Тарасики",
      "body": "<p>В <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Тарасики выступление Тома Уорда <i>(гитарист из Австралии)</i></p>",
      "meeting_time": "9:00",
      "meeting_place": "ст. м. Уручье",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-27",
      "title": "Выступление Тома Уорда в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> Куль",
      "body": "<p>В <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Куль выступление Тома Уорда <i>(гитарист из Австралии)</i></p>",
      "meeting_time": "9:00",
      "meeting_place": "стоянка возле ТЦ «Простор» <i>(Малиновка)</i>",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-29",
      "title": "Выезд <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне на Литургию в Заславле",
      "body": "<p>В храме Преображения Господня в Заславле после Божественной Литургии отслужится молебен преп. Сергию Радонежскому, у ковчежка с частицей мощей всеми нами почитаемого святого. В молебне примут участие наши друзья из <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне.</p>",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-09-30",
      "title": "Собрание Братства",
      "body": "Приглашены гости.",
      "event_time": "19:00",
      "event_place": "Приход в честь иконы Божией Матери «Всех Скорбящих Радость»"
    },
    {
      "date": "2013-10-02",
      "title": "Выезд в детский интернат г.Молодечно с Д.Каминским",
      "body": "<p>Выезд в детский интернат с проблеммами со зрением в г. Молодечно с Д. Каминским <i>(сольное выступление)</i></p>",
      "event_time": "15:00",
      "event_place": "Детский интернат с проблеммами со зрением в г. Молодечно",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-10-04",
      "title": "Выезд Борисовского <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Логойск на источник",
      "event_place": "храм св. Николая в г. Логойск",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-10-05",
      "title": "Выход <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> г. Молодечно на Божественную Литургию",
      "body": "Выход с насельниками <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> г. Молодечно в ближайший храм на Божественную Литургию",
      "organizer": "сестра Ангелина",
      "phone": "<a href=\"phone:+375291597704\">8 (029) 159-77-04</a>"
    },
    {
      "date": "2013-10-03",
      "title": "Посещение <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> в Дражне",
      "event_time": "18:00",
      "event_place": "ул. Ваупшасова, д. 33",
      "organizer": "сестра Татьяна",
      "phone": "<a href=\"phone:+375291432177\">8 (029) 143-21-77</a>"
    },
    {
      "date": "2013-10-09",
      "title": "Выезд в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> д. Куль",
      "meeting_time": "13:00",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-10-14",
      "title": "Благотворительный концерт для инвалидов",
      "body": "В здании общества слепых в ко Дню Покрова Пресвятой Богородицы и Дню Матери состоится благотворительный концерт для инвалидов",
      "event_time": "14:00",
      "event_place": "Общества слепых, Заводского района",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-10-17",
      "title": "Выезд в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> д. Тарасики",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    },
    {
      "date": "2013-10-18",
      "title": "Выезд в <abbr title=\"Психоневрологический интернат\">ПНИ</abbr> г. Молодечно",
      "organizer": "брат Сергий",
      "phone": "<a href=\"phone:+375293737250\">8 (029) 373-72-50</a>"
    }
  ] 
});
})();